tap "olets/tap"

# 開発環境
brew "ghcup"          # Haskell
brew "rustup"         # Rust
brew "nvm"            # TypeScript/Node
brew "uv"             # Python
brew "python@3.13"    # Python
brew "coursier"       # Scala
brew "openjdk"        # Scala (JVM)

# コンテナ
brew "colima"
brew "docker"
brew "docker-compose"
brew "lazydocker"

# CLI ツール（dotfiles使用）
brew "neovim"
brew "tmux"
brew "lazygit"
brew "starship"
brew "zoxide"
brew "fzf"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "procs"
brew "git-delta"
brew "gh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "olets/tap/zsh-abbr@6"
brew "borders"
brew "sketchybar"
